import React from 'react';
import logo from './logo.svg';
import './App.css';
import AggregatedData from './aggregatedData/AggregatedData';

const data =[
    {
        "ענף": "ענף",
        "סכום": "0סכום עסקה"
    },
    {
        "ענף": "שונות",
        "סכום": 25
    },
    {
        "ענף": "אירועים",
        "סכום": 51.6
    },
    {
        "ענף": "ביטוח ופיננסים",
        "סכום": 104.12
    },
    {
        "ענף": "תקשורת ומחשבים",
        "סכום": 149
    },
    {
        "ענף": "עמותות ותרומות",
        "סכום": 350
    },
    {
        "ענף": "מוסדות",
        "סכום": 375
    },
    {
        "ענף": "אנרגיה",
        "סכום": 400
    },
    {
        "ענף": "פנאי בילוי",
        "סכום": 451.61999999999995
    },
    {
        "ענף": "טיפוח ויופי",
        "סכום": 538.5
    },
    {
        "ענף": "מסעדות",
        "סכום": 669
    },
    {
        "ענף": "מזון מהיר",
        "סכום": 2431
    },
    {
        "ענף": "רפואה ובריאות",
        "סכום": 2615
    },
    {
        "ענף": "אופנה",
        "סכום": 3102.3099999999995
    },
    {
        "ענף": "מזון ומשקאות",
        "סכום": 7172.78
    },
    {
        "ענף": "ריהוט ובית",
        "סכום": 8203.5
    }
]
function App() {
  return (
    <div className="App">
      <AggregatedData data={data} />

    </div>
  );
}

export default App;
